fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокРеализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ЕжемесячнаяАбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВКМ_СоздатьРеализацииПоАбонентскимДоговорам(ДатаНачала, ДатаОкончания) Экспорт
    
    ТаблицаДоговоров = ВКМ_ПолучитьДоговорыСРеализациями(ДатаНачала, ДатаОкончания);
    
    Результат = Новый Массив;
    Для Каждого СтрокаДоговора Из ТаблицаДоговоров Цикл
        
        СтруктураРезультата = Новый Структура;
        СтруктураРезультата.Вставить("Договор", СтрокаДоговора.Договор);
        СтруктураРезультата.Вставить("Реализация", Неопределено);
        
        Если ЗначениеЗаполнено(СтрокаДоговора.СуществующаяРеализация) Тогда
            СтруктураРезультата.Реализация = СтрокаДоговора.СуществующаяРеализация;
            Результат.Добавить(СтруктураРезультата);
            Продолжить;
        КонецЕсли;
        
        Попытка
            НоваяРеализация = ВКМ_СоздатьРеализациюПоДоговору(
                СтрокаДоговора.Организация,
                СтрокаДоговора.Договор,
                ДатаОкончания);
            
            СтруктураРезультата.Реализация = НоваяРеализация.Ссылка;
            
        Исключение
            ЗаписьЖурналаРегистрации(
                "ВКМ_МассовоеСозданиеАктов",
                УровеньЖурналаРегистрации.Ошибка,
                ,
                "Не удалось создать реализацию по договору " + Строка(СтрокаДоговора.Договор),
                ИнформацияОбОшибке());
            
         КонецПопытки;
        
        Результат.Добавить(СтруктураРезультата);
        
    КонецЦикла;
    
    Возврат Результат;
    
КонецФункции

Функция ВКМ_ПолучитьДоговорыСРеализациями(ДатаНачала, ДатаОкончания)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Договоры.Ссылка КАК Договор,
    |	Договоры.Владелец КАК Контрагент,
    |	Договоры.Организация КАК Организация,
    |	Реализации.Ссылка КАК СуществующаяРеализация
    |ИЗ
    |	Справочник.ДоговорыКонтрагентов КАК Договоры
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализации
    |		ПО Договоры.Ссылка = Реализации.Договор
    |		И Реализации.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
    |		И Реализации.Проведен
    |		И НЕ Реализации.ПометкаУдаления
    |ГДЕ
    |	Договоры.ВидДоговора = &ВидДоговора
    |	И Договоры.ВКМ_ДатаНачала <= &ДатаОкончания
    |	И Договоры.ВКМ_ДатаОкончания >= &ДатаНачала
    |	И НЕ Договоры.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

Функция ВКМ_СоздатьРеализациюПоДоговору(Организация, Договор, ДатаДокумента)
    
    НовыйЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	
	НовыйЗаказ.Дата = ДатаДокумента;
	НовыйЗаказ.Организация = Организация;
	//@skip-check bsl-legacy-check-string-literal
	НовыйЗаказ.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Владелец");
	НовыйЗаказ.Договор = Договор;
	НовыйЗаказ.Комментарий = "Создано обработкой ""Массовое создание актов"" от " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
	ВКМ_ОбщийМодульВызовСервера.ВКМ_ВыполнитьАвтозаполнениеПоДоговору(НовыйЗаказ, Договор);
	НовыйЗаказ.СуммаДокумента = НовыйЗаказ.Услуги.Итог("Сумма");
	НовыйЗаказ.ПроверитьЗаполнение(); 
	НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение); 
        
    НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
    НоваяРеализация.Дата = ДатаДокумента;
    НоваяРеализация.Заполнить(НовыйЗаказ.Ссылка);
	НоваяРеализация.Комментарий = "Создано обработкой ""Массовое создание актов"" от " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
    НоваяРеализация.ВКМ_ВыполнитьАвтозаполнение();
	НоваяРеализация.ПроверитьЗаполнение();
	НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
       
    Возврат НоваяРеализация;
    
КонецФункции

#КонецОбласти

#КонецЕсли
